base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_УправлениеОбъектамиСистемы/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет наличие в системе механизма прав доступа.
// 
// Возвращаемое значение:
//  Булево - Истина, если есть механизм.
//
Функция ЕстьМеханизмПравДоступа()  Экспорт

	Возврат ЕстьОбщийМодуль("бит_ПраваДоступа");
	
КонецФункции

// Процедура обновляет справочник ОбъектыСистемы по метеданным.
// 
// Параметры:
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
// 
Функция ОбновитьОбъектыСистемы(РежимСообщений = "Все") Экспорт
	
	 Результат = Новый Структура("КоличествоПомеченных", 0);
	
	 Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.бит_ОбъектыСистемы) Тогда
		 Возврат Результат;
	 КонецЕсли; 
	 
	 Если НЕ ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		 
		 // В подчиненные узлы объекты системы должны прийти в результате обмена
		 // заполнение не нужно.
	 	 Возврат Результат;
	 
	 КонецЕсли; 
	 
	 ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	 ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);	 
	 
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Справочники",			РежимСообщений);
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Документы",				РежимСообщений);
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Отчеты",					РежимСообщений);
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Обработки",				РежимСообщений);
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("ПланыСчетов",			РежимСообщений);	
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("ПланыВидовХарактеристик",РежимСообщений);	 	 	 
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("РегистрыСведений",		РежимСообщений);
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("РегистрыНакопления",		РежимСообщений);	 
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("РегистрыБухгалтерии",	РежимСообщений);	 
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Задачи",					РежимСообщений);
	 ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("БизнесПроцессы",			РежимСообщений);
	 
	 КоличествоПомеченных = ПометитьНеиспользуемыеОбъектыСистемы(РежимСообщений);
	 
	 Результат.КоличествоПомеченных = КоличествоПомеченных;
	 
	 Возврат Результат;
	 
КонецФункции

// Функция выполняет поиск объекта доступа по типу.
// 
// Параметры:
//  ИмяОбъекта  - Строка
//  ВидОбъекта  - ПеречислениеСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
//   ТекущийОбъектДоступа   - СправочникСсылка.бит_ОбъектыСистемы.
// 
Функция НайтиОбъектДоступаПоТипу(ИмяОбъекта,ВидОбъекта) Экспорт
	 
	 ТекущийОбъектДоступа = Справочники.бит_ОбъектыСистемы.ПустаяСсылка();
	 
	 Если ТипЗнч(ИмяОбъекта) = Тип("Тип") Тогда
		 ТипОбъектаДоступа = ИмяОбъекта;
	 Иначе	
	     ИмяТипа = ПолучитьИмяТипаОбъекта(ИмяОбъекта,ВидОбъекта);		 
		 ТипОбъектаДоступа = Тип(ИмяТипа);
	 КонецЕсли; 
	 
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	 Запрос.Текст =
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	бит_ОбъектыСистемы.Ссылка КАК Ссылка,
	 |	бит_ОбъектыСистемы.ТипЗначенияОбъекта КАК ТипЗначенияОбъекта
	 |ИЗ
	 |	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	 |ГДЕ
	 |	НЕ бит_ОбъектыСистемы.ЭтоГруппа
	 |	И бит_ОбъектыСистемы.ВидОбъекта = &ВидОбъекта";
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 Пока Выборка.Следующий() Цикл
		 ТекущийТип = Выборка.ТипЗначенияОбъекта.Получить();
		 Если ТекущийТип = ТипОбъектаДоступа Тогда
			 ТекущийОбъектДоступа = Выборка.Ссылка;
		 КонецЕсли; 
	 КонецЦикла; 
	 
	 Возврат ТекущийОбъектДоступа;
	 
КонецФункции

// Функция определяет вид объекта по метаданным объекта.
// 
// Параметры:
//  МетаданныеОбъекта  - ОбъектМетаданных.
// 
// Возвращаемое значение:
//   ВидОбъекта   - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
Функция ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта)  Экспорт
	
	ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПустаяСсылка();
	 
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник;
 	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда	
	 	ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ;
	ИначеЕсли Метаданные.Отчеты.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Отчет;
	ИначеЕсли Метаданные.Обработки.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Обработка;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрСведений;
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления;	
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов;		 
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланВидовХарактеристик;		 
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии;		 
	ИначеЕсли Метаданные.Задачи.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Задача;
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.БизнесПроцесс;
	КонецЕсли; 
	 
	Возврат ВидОбъекта;
 
КонецФункции
 
// Функция получает полное имя объекта
// 
// Параметры:
//  ИмяОбъекта  - Строка - Краткое имя объекта.
//  ВидОбъекта  - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
// Возвращаемое значение:
//   РезСтрока   - Строка.
// 
Функция ПолучитьПолноеИмяОбъекта(ИмяОбъекта, ВидОбъекта) Экспорт
	
	РезСтрока = СтрШаблон("%1.%2",
		бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ВидыОбъектовСистемы, ВидОбъекта), ИмяОбъекта);	
	Возврат РезСтрока;
	
КонецФункции
 
// Функция получает имя типа объекта
// 
// Параметры:
//  ИмяОбъекта  - Строка - Краткое имя объекта.
//  ВидОбъекта  - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
// Возвращаемое значение:
//   РезСтрока   - Строка.
// 
Функция ПолучитьИмяТипаОбъекта(ИмяОбъекта,ВидОбъекта) Экспорт
	
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
		РезСтрока = "ДокументСсылка."+ИмяОбъекта;		
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник Тогда
		РезСтрока = "СправочникСсылка."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Обработка Тогда
		РезСтрока = "ОбработкаОбъект."+ИмяОбъекта;		
    ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Отчет Тогда	
		РезСтрока = "ОтчетОбъект."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрСведений Тогда
		РезСтрока = "РегистрСведенийНаборЗаписей."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления Тогда
		РезСтрока = "РегистрНакопленияНаборЗаписей."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
		РезСтрока = "РегистрБухгалтерииНаборЗаписей."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов Тогда
		РезСтрока = "ПланСчетовСсылка."+ИмяОбъекта;		
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланВидовХарактеристик Тогда
		РезСтрока = "ПланВидовХарактеристикСсылка."+ИмяОбъекта;				
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Задача Тогда
		РезСтрока = "ЗадачаСсылка."+ИмяОбъекта;	
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.БизнесПроцесс Тогда
		РезСтрока = "БизнесПроцессСсылка."+ИмяОбъекта;
	КонецЕсли; 
	
	Возврат РезСтрока;
	
КонецФункции

// Функция определяет картинку по виду объекта.
// 
// Параметры:
//  ВидОбъекта  - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
// Возвращаемое значение:
//   РезКартинка   - Картинка.
// 
Функция ОпределитьКартинкуВидаОбъекта(ВидОбъекта) Экспорт

	РезКартинка = Неопределено;
	
	КартинкиОбъектов = Новый Соответствие;
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.Справочник,				БиблиотекаКартинок.Справочник);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.Документ,				БиблиотекаКартинок.ДокументОбъект);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.Обработка,				БиблиотекаКартинок.Обработка);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.Отчет,					БиблиотекаКартинок.Отчет);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.ПланВидовХарактеристик,	БиблиотекаКартинок.ПланВидовХарактеристик);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов,				БиблиотекаКартинок.ПланСчетов);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии,		БиблиотекаКартинок.РегистрБухгалтерии);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления,		БиблиотекаКартинок.РегистрНакопления);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.РегистрСведений,			БиблиотекаКартинок.РегистрСведений);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.Задача,					БиблиотекаКартинок.Задача);
	КартинкиОбъектов.Вставить(Перечисления.бит_ВидыОбъектовСистемы.БизнесПроцесс,			БиблиотекаКартинок.БизнесПроцесс);	
	
	РезКартинка = КартинкиОбъектов[ВидОбъекта];
	
	Возврат РезКартинка;

КонецФункции

// Функция возвращает имя формы 
// для работы с процедурой глобального контекста "ПолучитьФорму".
// 
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектСистемы.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьФормуОбъекта(ОбъектСистемы) Экспорт

	Форма = Неопределено;
	ИмяФ  = Неопределено;
   		
	Если ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
		МенеджерОбъект = Документы[ОбъектСистемы.ИмяОбъекта];
		ОбъектСсылка = Документы[ОбъектСистемы.ИмяОбъекта].ПустаяСсылка(); 
	ИначеЕсли ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник Тогда
		МенеджерОбъект = Справочники[ОбъектСистемы.ИмяОбъекта];
		ОбъектСсылка = Справочники[ОбъектСистемы.ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	Если ОбъектСсылка = Неопределено Тогда
    	Возврат Форма;
	КонецЕсли;
		
	ОсновнаяФорма  = ОбъектСсылка.Метаданные().ОсновнаяФормаОбъекта;
	Если ОсновнаяФорма = Неопределено Тогда
		// Если основная форма не существует - проверяем сразу дополнительную.
		ПроверитьПолучитьИмяДополнительнойФормы(ОбъектСсылка, МенеджерОбъект, ИмяФ);
	Иначе
		// Иначе получаем имя основной формы
		ИмяФ = ОсновнаяФорма.Имя;
	КонецЕсли; 
		
	// Получаем форму (или строку для получения формы на клиенте).
	Если ИмяФ <> Неопределено Тогда
		Форма = (СтрЗаменить(Строка(МенеджерОбъект), "Менеджер", "") + ".Форма." + ИмяФ);
	КонецЕсли; 
	
	// Предупреждение, если форма не найдена
	Если Форма = Неопределено Тогда
   		ТекстСообщения = НСтр("ru = 'Форма не найдена.';
							  |en = 'No form found.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
  	
	Возврат Форма;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция определяет наличие в системе общего модуля с указанным имененм.
// 
// Параметры:
//  ИмяМодуля  - Строка.
// 
// Возвращаемое значение:
//   флЕстьМодуль   - Булево.
// 
Функция ЕстьОбщийМодуль(ИмяМодуля)
	
	флЕстьМодуль = Истина;
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		флЕстьМодуль = Ложь;	
	КонецЕсли; 

	Возврат флЕстьМодуль;
	
КонецФункции

// Устанавливает пометку удаления для объектов системы, которые более не используются, 
// т.е. для которых нет соответсвующих объектов метаданных.
// 
// Параметры:
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  КоличествоПомеченных - Число.
// 
Функция ПометитьНеиспользуемыеОбъектыСистемы(РежимСообщений = "Все")

	 КоличествоПомеченных = 0;	
	 
	 ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	 ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);	 
	 
	 // Поиск объектов системы не соответствющих объектам конфигурации.
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	бит_ОбъектыСистемы.Ссылка КАК Ссылка,
	 |	бит_ОбъектыСистемы.ТипЗначенияОбъекта КАК ТипЗначенияОбъекта,
	 |	бит_ОбъектыСистемы.ИмяОбъектаПолное КАК ИмяОбъектаПолное,
	 |	бит_ОбъектыСистемы.ВидОбъекта КАК ВидОбъекта,
	 |	бит_ОбъектыСистемы.ИмяОбъекта КАК ИмяОбъекта
	 |ИЗ
	 |	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	 |ГДЕ
	 |	НЕ бит_ОбъектыСистемы.ЭтоГруппа
	 |	И НЕ бит_ОбъектыСистемы.ПометкаУдаления";
					
	 Результат = Запрос.Выполнить();				
	 
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	ТипОбъекта = Выборка.ТипЗначенияОбъекта.Получить();
		Если ТипОбъекта = Тип("Неопределено") Тогда
		
			СпрОб = Выборка.Ссылка.ПолучитьОбъект();
			Попытка
				СпрОб.УстановитьПометкуУдаления(Истина);
				КоличествоПомеченных = КоличествоПомеченных+1;
			Исключение
				Если ВыводитьОшибки Тогда
					ТекстСообщения = НСтр("ru='Не удалось пометить на удаление объект системы ""%1"".';
										  |en='Unable to mark system object ""%1"" for removal.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Ссылка);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
			КонецПопытки;
		КонецЕсли; 
	 КонецЦикла;
	 
	 Если ВыводитьИнформацию И КоличествоПомеченных Тогда
		 ТекстСообщения = НСтр("ru='В справочнике ""Объекты системы"" обнаружены элементы не соответствующие объектам метаданных. 
								   |Данные элементы помечены на удаление. Рекомендуется выполнить удаление этих элементов перед продолжением работы.';
							   |en='The reference ""System objects"" found elements are not relevant metadata objects.
								   |Data elements are marked for deletion. We recommend that you remove these items before continuing.'");
		 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);						  
	 КонецЕсли; 

	Возврат КоличествоПомеченных;
	
КонецФункции

// Функция выполняет поиск по имени группу объектов системы.
// 
// Параметры:
//  ИмяГруппы  - Строка.
// 
// Возвращаемое значение:
//   НайденнаяГруппа   - Справочники.бит_ОбъектыСистемы.
// 
Функция НайтиПредопределеннуюГруппу(ИмяГруппы)

	НайденнаяГруппа = Справочники.бит_ОбъектыСистемы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.ЭтоГруппа
	|	И бит_ОбъектыСистемы.Предопределенный";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 ИмяПредопределенного = Справочники.бит_ОбъектыСистемы.ПолучитьИмяПредопределенного(Выборка.Ссылка);
		 Если ИмяПредопределенного = ИмяГруппы Тогда
		 	НайденнаяГруппа = Выборка.Ссылка;
		 КонецЕсли; 
	КонецЦикла; 

	Возврат НайденнаяГруппа;
	
КонецФункции

// Процедура Заполняет/обновляет справочник объекты доступа по коллекции метаданных. 
// При изменении имени объекта выполняется поиск по типу и обновляется имя. 
// 
// Параметры:
//  ИмяКоллекции  - строка.
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
// 
Процедура ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных(ИмяКоллекции, РежимСообщений = "Все")
	
	ВыводитьОшибки     = РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки";
	ВыводитьИнформацию = РежимСообщений = "Все";
	
	// Проверим и при необходимости установим вид объекта в группе.
	ТекГруппа = НайтиПредопределеннуюГруппу(ИмяКоллекции);
	Если ЗначениеЗаполнено(ТекГруппа) И Не ЗначениеЗаполнено(ТекГруппа.ВидОбъекта) Тогда
		
		ГруппаОбъект = ТекГруппа.ПолучитьОбъект(); 
		КоллекцияМетаданных = Метаданные[ИмяКоллекции];
		Если КоллекцияМетаданных.Количество() > 0 Тогда
			
			ГруппаОбъект.ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(КоллекцияМетаданных[0]);	
			Попытка				
				ГруппаОбъект.Записать();
				Если ВыводитьИнформацию Тогда
					ТекстСообщения = НСтр("ru='Для группы объектов системы %1 установлен вид %2.';
										  |en='For group of system objects %1, view %2 is set.'"); 
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекГруппа, ГруппаОбъект.ВидОбъекта);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
			Исключение
				Если ВыводитьОшибки Тогда
					ТекстСообщения = НСтр("ru='Не удалось записать группу объектов системы %1.';
										  |en='Failed to write system object group %1.'"); 
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекГруппа);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЕсли; // Нужно устанавливать вид группы.
	
	ВидОбъекта = Неопределено;
	Для каждого Мета Из Метаданные[ИмяКоллекции] Цикл
		
		// Регистры сведений - только независимые.
		Если ИмяКоллекции = "РегистрыСведений" Тогда
			 Если Мета.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			 	Продолжить;
			 КонецЕсли; 
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ВидОбъекта) Тогда
			ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(Мета);
		КонецЕсли; 
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ИмяОбъекта",			Мета.Имя);
		СтруктураПараметров.Вставить("ВидОбъекта",			ВидОбъекта);
		СтруктураПараметров.Вставить("Наименование",		Мета.Синоним);
		СтруктураПараметров.Вставить("ИмяОбъектаПолное",	ПолучитьПолноеИмяОбъекта(Мета.Имя,СтруктураПараметров.ВидОбъекта));
		СтруктураПараметров.Вставить("ИмяТипаОбъекта",		ПолучитьИмяТипаОбъекта(Мета.Имя,СтруктураПараметров.ВидОбъекта));
		СтруктураПараметров.Вставить("ТипЗначенияОбъекта",	Тип(СтруктураПараметров.ИмяТипаОбъекта));
		СтруктураПараметров.Вставить("Родитель",			ТекГруппа);
		
		ОбъектДоступа = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное",СтруктураПараметров.ИмяОбъектаПолное);
		Если НЕ ЗначениеЗаполнено(ОбъектДоступа) ИЛИ ОбъектДоступа.Наименование <> Мета.Синоним Тогда
			
			ОбъектДоступа = НайтиОбъектДоступаПоТипу(Мета.Имя,ВидОбъекта);
			// Проверим а не изменилось ли имя объекта.
			Если ЗначениеЗаполнено(ОбъектДоступа) 
				  И (ОбъектДоступа.ИмяОбъекта <> Мета.Имя 
				     ИЛИ ОбъектДоступа.Наименование <> Мета.Синоним
				     ИЛИ ОбъектДоступа.ИмяОбъектаПолное <>СтруктураПараметров.ИмяОбъектаПолное) Тогда
				
				СпрОбъект = ОбъектДоступа.ПолучитьОбъект();
				ЗаполнитьОбъектДоступа(СпрОбъект,СтруктураПараметров);
				СпрОбъект.Родитель = ОбъектДоступа.Родитель;
				Попытка
					СпрОбъект.Записать();
					Если ВыводитьИнформацию Тогда
						ТекстСообщения = НСтр("ru='Обновлен объект системы %1.';
											  |en='System object updated %1.'"); 
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураПараметров.ИмяОбъектаПолное);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					КонецЕсли; 
					Продолжить;
				Исключение
					Если ВыводитьОшибки Тогда
						ТекстСообщения = НСтр("ru='Не удалось записать объект системы %1.';
											  |en='Failed to write system object %1.'"); 
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураПараметров.ИмяОбъектаПолное);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					КонецЕсли; 
				КонецПопытки;
				
			КонецЕсли; // Проверка изменения имени объекта.
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ОбъектДоступа) Тогда
			СпрОбъект = Справочники.бит_ОбъектыСистемы.СоздатьЭлемент();
			ЗаполнитьОбъектДоступа(СпрОбъект,СтруктураПараметров);
			СпрОбъект.Отключено = Истина;
			Попытка
				СпрОбъект.Записать();
				Если ВыводитьИнформацию Тогда
					ТекстСообщения = НСтр("ru='Записан новый объект системы %1.';
										  |en='New system object recorded %1.'"); 
					ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураПараметров.ИмяОбъектаПолное);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
			Исключение
				Если ВыводитьОшибки Тогда
					ТекстСообщения = НСтр("ru='Не удалось записать объект системы %1.';
										  |en='Failed to write system object %1.'"); 
					ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураПараметров.ИмяОбъектаПолное);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
			КонецПопытки;
		
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

// Получеат имя дополнительной формы, если она существует.
// 
// Параметры:
//  ОбъектСсылка  	- Ссылка.
//  МенеджерОбъект 	- МенеджерОбъект.               
//  Форма 			- Форма. 
// 
Процедура ПроверитьПолучитьИмяДополнительнойФормы(ОбъектСсылка, МенеджерОбъект, ИмяФ)

	ДополнитФорма = ОбъектСсылка.Метаданные().ДополнительнаяФормаОбъекта;	
	Если ДополнитФорма <> Неопределено Тогда
		ИмяФ = ДополнитФорма.Имя;
	КонецЕсли;

КонецПроцедуры

// Процедура заполняет свойства элемента справочника объекта доступа из структуры параметров.
// 
// Параметры:
// ТекущийОбъект - СправочникСсылка.бит_ОбъектыСистемы.
// 
Процедура ЗаполнитьОбъектДоступа(ТекущийОбъект,СтруктураПараметров)
	
	ЗаполнитьЗначенияСвойств(ТекущийОбъект,СтруктураПараметров);
 	ТекущийОбъект.ТипЗначенияОбъекта = Новый ХранилищеЗначения(СтруктураПараметров.ТипЗначенияОбъекта);
 
КонецПроцедуры
  
#КонецОбласти
